# Yuhe Wu
# week13 - 2021/11/18
# Python Pandas DataFrame - Mapping, Applying, and Grouping

In [1]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

In [2]:
#mapping
df = DataFrame({'city':['Alma','Brian Head','Fox Park','Lake Mary'],
               'altitude':[10355,9800,9062,8966]})
df

         city  altitude
0        Alma     10355
1  Brian Head      9800
2    Fox Park      9062
3   Lake Mary      8966

In [3]:
st_map={'Alma':'Colorado',
        'Brian Head':'Utah',
       'Fox Park':'Wyoming',
        'Lake Mary':'California'}
st_map

{'Alma': 'Colorado',
 'Brian Head': 'Utah',
 'Fox Park': 'Wyoming',
 'Lake Mary': 'California'}

In [4]:
df['state'] = df['city'].map(st_map)
df

         city  altitude       state
0        Alma     10355    Colorado
1  Brian Head      9800        Utah
2    Fox Park      9062     Wyoming
3   Lake Mary      8966  California

In [9]:
# apply
def meter(x):
    return x / 3.2808

In [10]:

df['altitude'] = df['altitude'].apply(meter)
df

         city    altitude       state
0        Alma  962.034376    Colorado
1  Brian Head  910.471935        Utah
2    Fox Park  841.907824     Wyoming
3   Lake Mary  832.988915  California

In [11]:
df['altitude'] = df['altitude'].apply(lambda x: np.nan if x < 850 else x)

In [12]:
df

         city    altitude       state
0        Alma  962.034376    Colorado
1  Brian Head  910.471935        Utah
2    Fox Park         NaN     Wyoming
3   Lake Mary         NaN  California

In [13]:
df = DataFrame(np.random.randn(4,3),columns=list('bde'),
              index=['UT','OH','TX','OR'])
df

           b         d         e
UT -2.391360 -0.729405 -0.391505
OH  0.430472  1.720206 -1.468605
TX -0.435716  0.504624  0.281098
OR  0.077953  0.493354 -1.205722

In [14]:
def dif(x):
    return x.max() - x.min()

In [15]:
df.apply(dif)

b    2.821832
d    2.449610
e    1.749703
dtype: float64

In [17]:
df.apply(dif,axis=1)

UT    1.999854
OH    3.188811
TX    0.940340
OR    1.699077
dtype: float64

In [18]:
df.apply(lambda x: x.max() - x.min())

b    2.821832
d    2.449610
e    1.749703
dtype: float64

In [19]:
df.apply(lambda x: x.max() - x.min(), axis=1)

UT    1.999854
OH    3.188811
TX    0.940340
OR    1.699077
dtype: float64